import VideoPlayer from '../../atoms/videoPlayer/VideoPlayer';

export default function SarkveviInstruction() {
  return (
    <section className="mt-8">
      <div>
        <h2 className="text-title-sm font-bold leading-[1.5] text-charcoalGrey max-1000:text-subtitle max-450:text-[16px]">
          გამოყენების ინსტრუქცია
        </h2>
      </div>

      <div className="mt-6 flex justify-between gap-[30px] max-1000:mt-[12px] max-1000:flex-col-reverse max-1000:items-center max-1000:gap-[10px] max-450:text-[12px]">
        <p className="w-full flex-1 text-[14px] !leading-[1.8] text-charcoalGrey max-450:text-[12px]">
          სარკვევი არის ინსტრუმენტი, რომლის მეშვეობით შესაძლებელია საკვლევი
          ობიექტების, მაგალითად, ცოცხალი ორგანიზმების, მათ შორის, მცენარეების
          იდენტიფიკაცია ანუ მათი რაობის დადგენა. წინამდებარე სარკვევი გვაძლევს
          საშუალებას დავადგინოთ თუ რომელ ბოტანიკურ ოჯახს მიეკუთვნება თბილისის
          მიდამოების ფლორის ესა თუ ის მცენარე. მისი დახმარებით შესაძლებელია
          100-ზე მეტი ბოტანიკური ოჯახის იდენტიფიკაცია, რომლებსაც თბილისის
          მიდამოებში აღრიცხულ მცენარეთა 1600-ზე მეტი სახეობა მიეკუთვნება.
          თბილისის მიდამოების ფლორის ოჯახების წინამდებარე სარკვევი შედგება
          დაწყვილებული დებულებებისაგან, რომლებიც აღწერს საკვლევ ობიექტს (ამ
          შემთხვევაში საიდენტიფიკაციო ანუ გასარკვევ მცენარეს). ამასთან, თითოეული
          დებულება წყვილის მეორე დებულების ანტიპოდია, ამიტომ პირველ დებულებას
          თეზა, ხოლო მეორეს ანტითეზა ეწოდება. იდენტიფიკაციის ანუ რკვევის თითოეულ
          საფეხურზე აუცილებელია განხილული იქნეს თეზაც და ანტითეზაც, თუნდაც ერთი
          შეხედვით თეზა საიდენტიფიკაციო მცენარის ნიშან-თვისებათა შესაბამისად
          მივიჩნიოთ.  თითოეული დებულება მიგვითითებს იმ საფეხურის (დებულებათა
          წყვილის ანუ თეზა-ანტითეზის) რიგით  ნომერს, რომელზეც უნდა გადავიდეთ, თუ
          გასარკვევი მცენარის მახასიათებლები მოცემულ დებულებაში აღწერილის
          შესაბამისია. რკვევის პროცესში ყოველ მომდევნო საფეხურზე გადასასვლელად
          თითოეული წყვილიდან ვირჩევთ იმ დებულებას, რომელიც გასარკვევი მცენარის
          ნიშან-თვისებებს მიესადაგება. ერთი საფეხურიდან მეორეზე გადასვლისას,
          ბოტანიკური ოჯახების შესაძლო ვარიანტების სიმრავლე ვიწროვდება და
          საბოლოოდ მივდივართ იმ ბოტანიკურ ოჯახამდე, რომელსაც საიდენტიფიკაციო
          მცენარე მიეკუთვნება. ოჯახის გარკვევის შემდეგ შეგვიძლია გადავიდეთ ამ
          ოჯახის შესაბამის გვერდზე, რომელზეც მოცემულია ოჯახის ნიშან-თვისებათა
          აღწერა და ოჯახის წარმომადგენელი მცენარის სანიმუშო ილუსტრაცია.
        </p>
        <div className="h-[350px] w-[470px] rounded-[10px] border border-strokeGrey shadow-lg max-1000:h-[270px] max-1000:w-[510px] max-1000:rounded-lg max-600:w-full max-450:h-[205px] max-450:rounded-[5px]">
          <VideoPlayer
            classname="rounded-[10px] max-1000:rounded-lg max-450:rounded-[5px]"
            src="/assets/videos/test.mp4"
          />
        </div>
      </div>
    </section>
  );
}
