import Button from '../../atoms/buttons/Button';
import { aboutProjectImg } from '../../../assets';
import BookIcon from '../../../../assets/svgs/book-open-alt.svg?react';

export default function AboutProjectSection() {
  return (
    <>
      <section>
        <h2 className="text-title-sm font-bold leading-[1.5] text-charcoalGrey max-1000:text-subtitle max-450:text-[16px]">
          პროექტის შესახებ
        </h2>
        <div className="mb-1 mt-16 max-700:flex max-700:flex-col-reverse max-700:items-center">
          <img
            src={aboutProjectImg}
            alt=""
            className="float-right ml-[28.57px] mt-2 h-full max-h-[330px] w-full max-w-[471px] rotate-180 scale-y-[-1] rounded-[10px] max-1050:w-[400px] max-900:w-[350px] max-800:w-[290px] max-700:my-4 max-700:ml-0 max-700:w-full"
          />
          <div className="">
            <p className="mb-1 w-full flex-1 text-[14px] leading-[21px] text-charcoalGrey">
              პროექტის „საქართველოს მცენარეთა განყოფილებებისა და ოჯახების
              სარკვევი“ იდეა გაჩნდა 2023 წელს ბოტანიკის საბაკალავრო კურსის
              სწავლებისას, მას შემდეგ, რაც კურსის ერთ-ერთმა სტუდენტმა
              შემატყობინა „უნილაბის“ საქმიანობისა და მასთან თანამშრომლობის
              შესაძლებლობების შესახებ. პროექტის მიზნად დავსახეთ მცენარეთა (ამ
              ეტაპზე თბილისის მიდამოების ფლორის) ბოტანიკური ოჯახების სარკვევის
              ინტერაქტიური ელექტრონული ვარიანტის შექმნა.
            </p>
            <p className="w-full flex-1 text-[14px] leading-[21px] text-charcoalGrey">
              ელექტრონულ რესურსს საფუძველად უდევს მცენარეთა ბეჭდური სარკვევი -
              ა. მაყაშვილის „თბილისის მიდამოების ფლორის“ ორტომეული (1952, 1953),
              რომელიც თბილისის მიდამოებში აღრიცხულ მცენარეთა 1600-ზე მეტ
              სახეობას შეიცავს 100-ზე მეტი ბოტანიკური ოჯახიდან. „ფლორა“
              მცენარეთა მსხვილი ჯგუფების და მათი ოჯახების სარკვევი ტაბულით
              იწყება და სწორედ ეს ტაბულა და მისი მეშვეობით მიგნებული ოჯახების
              მოკლე აღწერა შევიდა ინტერაქტიური სარკვევის შემადგენლობაში.
              მართალია, წიგნში შეტანილი ზოგიერთი ოჯახის ტაქსონომიური სტატუსი და
              შემადგენლობა ამჟამად მეტ-ნაკლებად შეცვლილია, „ფლორას“ მნიშვნელობა
              დღესაც არ დაუკარგავს. იგი თბილისის მიდამოების მცენარეთა ერთადერთი
              სრული სარკვევია, რომელშიც ნათლადაა მოცემული მცენარეთა სხვადასხვა
              ტაქსონომიური რანგის ჯგუფების განმასხვავებელი ნიშნები. ამიტომ
            </p>
          </div>
        </div>

        <div className="flex flex-col gap-1">
          <p className="!leading-[1.8 ] w-full text-[14px] leading-[21px] text-charcoalGrey">
            თანამედროვე საკლასიფიკაციო სისტემებისგან ზოგიერთი განსხვავების
            მიუხედავად, ეს სარკვევი დამწყებთათვის ერთ-ერთ საუკეთესოდ მიგვაჩნია.
            სარკვევზე მუშაობის მომდევნო ეტაპებზე მასში შესული ოჯახების სისტემას
            თანამედროვე სტანდარტებს დავუახლოვებთ.
          </p>
          <p className="!leading-[1.8 ] w-full text-[14px] leading-[21px] text-charcoalGrey">
            სარკვევში გამოყენებულია „უნილაბში“ ელექტრონული თუ ბეჭდური წყაროების
            დახმარებით შექმნილი ორიგინალური ილუსტრაციები (მაგ., Harris & Harris,
            2001), აგრეთვე, ილუსტრაციები მე-19 საუკუნის გერმანული წყაროებიდან
            (მაგ., Köhler, 1887; Thome, 1885).
          </p>
          <p className="!leading-[1.8 ] w-full text-[14px] leading-[21px] text-charcoalGrey">
            მცენარეთა იდენტიფიკაციით დაინტერესებული ადამიანებისათვის მცენარეთა
            მრავალფეროვნების გაცნობის პირველ ეტაპზე ყველაზე მნიშვნელოვანი
            მცენარეთა მსხვილი ჯგუფებისა და მათი ოჯახების ამოცნობის უნარ-ჩვევების
            განვითარებაა და სწორედ ამ მიზანს ემსახურება ელექტრონული რესურსი
            „საქართველოს მცენარეთა განყოფილებებისა და ოჯახების სარკვევი“
          </p>
          <p className="!leading-[1.8 ] w-full text-[14px] leading-[21px] text-charcoalGrey">
            სარკვევი განკუთვნილია საბაკალავრო საფეხურის სტუდენტებისათვის,
            რომლებსაც ეკითხებათ სასწავლო კურსი „ბოტანიკა“, ასევე ბოტანიკით
            დაინტერესებული მაგისტრანტების, დოქტორანტების, მკვლევარებისა და
            მოყვარული ბოტანიკოსებისათვის, რომლებსაც აქვთ სურვილი მცენარეთა
            ოჯახების რკვევის პრაქტიკულ უნარ-ჩვევებს დაეუფლონ.
          </p>
        </div>
      </section>
      <a
        href="https://linkedin.com/"
        target="_blank"
        className="group mb-[96px] mt-[85px] flex w-fit max-1000:mx-auto"
      >
        <Button
          label="წიგნის ნახვა (PDF)"
          variant="secondary"
          iconPosition="left"
        >
          <BookIcon className="transition-all duration-300 group-hover:[&>path]:fill-white" />
        </Button>
      </a>
    </>
  );
}
